ams/src/Documents/_ТранспортныеУслуги/_ТранспортныеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ТранспортныеУслуги</name>
  <registerRecords>InformationRegister._ОплатаРейсов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыАктовПоПеревозкам</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рейсы</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛогистическийЛист</name>
      <type>
        <types>DocumentRef.AMS_ЛогистическийЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаВодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаАгента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПропуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоставкаПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоставкаВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодвозПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодвозВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоплатаЗаДополнительноеВремя</name>
    <attributes>
      <name>ЛогистическийЛист</name>
      <type>
        <types>DocumentRef.AMS_ЛогистическийЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЧека</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Метка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрафыЗаНарушенияДоговора</name>
    <attributes>
      <name>ЛогистическийЛист</name>
      <type>
        <types>DocumentRef.AMS_ЛогистическийЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоговора</name>
      <type>
        <types>EnumRef._ПунктыДоговора</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаШтрафа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Метка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрафыЗаПретензии</name>
    <attributes>
      <name>ЛогистическийЛист</name>
      <type>
        <types>DocumentRef.AMS_ЛогистическийЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеПретензии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПретензии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Метка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Enums/_ПунктыДоговора/_ПунктыДоговора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_ПунктыДоговора</name>
  <enumValues>
    <name>Пункт52</name>
    <comment>Исполнитель несет ответственность за повреждение и недостачу груза после принятия его к перевозке от Заказчика, в размере двукратной цены утраченного или поврежденного груза.</comment>
  </enumValues>
  <enumValues>
    <name>Пункт53</name>
    <comment>Исполнитель несет ответственность за срыв выполнения логистического задания в размере однодневного тарифа данного автотранспорта.</comment>
  </enumValues>
  <enumValues>
    <name>Пункт54</name>
    <comment>Исполнитель несет ответственность за несвоевременную доставку груза Грузополучателю заказчика в размере 25% от дневного тарифа данного автотранспорта.</comment>
  </enumValues>
  <enumValues>
    <name>Пункт55</name>
    <comment>Исполнитель несет ответственность за несвоевременную сдачу Товарно-сопроводительных документов Заказчику в размере 500 руб./один документ.</comment>
  </enumValues>
  <enumValues>
    <name>Пункт56</name>
    <comment>Исполнитель несет ответственность за утрату товарно-сопроводительных документов в размере однодневного тарифа данного автотранспорта.</comment>
  </enumValues>
  <enumValues>
    <name>Пункт57</name>
    <comment>Исполнитель несет ответственность за невыход автотранспорта на маршрут, утвержденный в Логистическом листе с Заказчиком, в размере однодневного тарифа, соответствующей единицы автотранспорта.</comment>
  </enumValues>
  <enumValues>
    <name>Пункт58</name>
    <comment>В случае, если указанные в настоящем пункте документы, а именно: УПД, Товарная накладная формы Торг-12, Товарно-Транспортная накладная не будут подписаны со стороны Грузополучателя, либо подписанные Грузополучателем документы не будут переданы Исполнителе</comment>
  </enumValues>
  <enumValues>
    <name>Пункт59</name>
    <comment>В случае невыполнения логистического задания Исполнитель возмещает Заказчику все понесенные им убытки в полном размере.</comment>
  </enumValues>
  <enumValues>
    <name>Пункт71</name>
  </enumValues>
  <enumValues>
    <name>Пункт72</name>
  </enumValues>
  <enumValues>
    <name>Пункт73</name>
  </enumValues>
  <enumValues>
    <name>Пункт74</name>
  </enumValues>
  <enumValues>
    <name>Пункт75</name>
  </enumValues>
  <enumValues>
    <name>Пункт76</name>
  </enumValues>
  <enumValues>
    <name>Пункт77</name>
  </enumValues>
  <enumValues>
    <name>Пункт78</name>
  </enumValues>
  <enumValues>
    <name>Пункт79</name>
  </enumValues>
</mdclass:Enum>

ams/src/Documents/_ТранспортныеУслуги/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СформироватьАктВыполненныхРабот(МассивОбъектов) Экспорт
	Данные = ПолучитьДанныеПакетаЗапроса(МассивОбъектов[0]);

	ТабДок = Новый ТабличныйДокумент;

	Макет = ПолучитьМакет("Акт");

	ОбластьШапка   = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка1  = Макет.ПолучитьОбласть("Шапка1");
	ОбластьШапка2  = Макет.ПолучитьОбласть("Шапка2");
	ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка1");
	ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
	ОбластьИтог    = Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал  = Макет.ПолучитьОбласть("Подвал");
	
	//Шапка
	Рез = Данные.Шапка;
	Выб = Рез.Выбрать();
	Выб.Следующий();
	ОбластьШапка.Параметры.Организация= Выб.Организация;
	ОбластьШапка.Параметры.Договор = "Приложение № 3 к договору об оказании транспортных услуг № " + Выб.ДоговорНомер
		+ " от " + формат(Выб.ДоговорДата, "ДЛФ=ДД");

	ОбластьШапка.Параметры.Акт = Формат(Выб.Дата, "ДЛФ=ДД");

	ОбластьШапка.Параметры.Контрагент    = Выб.Контрагент;
	ОбластьШапка.Параметры.ДатаНачала    = Формат(Выб.ДатаНачала, "ДЛФ=Д");
	ОбластьШапка.Параметры.ДатаОкончания = Формат(Выб.ДатаОкончания, "ДЛФ=Д");
	ОбластьШапка.Параметры.Комментарий   = Выб.Комментарий;
	ТабДок.Вывести(ОбластьШапка);
	
	//Услуги 
	НомерСтроки = 0;
	СуммаУслуг  = 0;

	Рез = Данные.Рейсы;
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
		СуммаУслуг = СуммаУслуг + Выб.Сумма;
		ОбластьСтрока.Параметры.Заполнить(Выб);
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	ОбластьИтог.Параметры.Сумма = СуммаУслуг;
	ТабДок.Вывести(ОбластьИтог);
	
	//Штраф
	ТабДок.Вывести(ОбластьШапка1);

	НомерСтроки = 0;
	СуммаШтраф  = 0;

	Рез = Данные.Штрафы;
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
		СуммаШтраф = СуммаШтраф + Выб.Сумма;
		ОбластьСтрока1.Параметры.Заполнить(Выб);
		ОбластьСтрока1.Параметры.НомерСтроки = НомерСтроки;
		ТабДок.Вывести(ОбластьСтрока1);
	КонецЦикла;
	ОбластьИтог.Параметры.Сумма = СуммаШтраф;
	ТабДок.Вывести(ОбластьИтог);
	
	//Претензии
	ТабДок.Вывести(ОбластьШапка2);

	НомерСтроки    = 0;
	СуммаПретензии = 0;

	Рез = Данные.Претензии;
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
		СуммаПретензии = СуммаПретензии + Выб.Сумма;
		ОбластьСтрока2.Параметры.Заполнить(Выб);
		ОбластьСтрока2.Параметры.НомерСтроки = НомерСтроки;
		ТабДок.Вывести(ОбластьСтрока2);
	КонецЦикла;
	ОбластьИтог.Параметры.Сумма = СуммаПретензии;
	ТабДок.Вывести(ОбластьИтог);
	
	//Подвал
	ОбластьПодвал.Параметры.Сумма = СуммаУслуг - СуммаШтраф - СуммаПретензии;
	ТабДок.Вывести(ОбластьПодвал);
	
    //РАСШИФРОВКА
	РезШтрафы = Данные.ШтрафыДетали;
	РезПретензии = Данные.ПретензииДетали;

	ЕстьШтрафы = Не РезШтрафы.Пустой();
	ЕстьПретензии = Не РезПретензии.Пустой();

	//Если ЕстьШтрафы Или ЕстьПретензии Тогда
	//	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();

	//	ОбластьПриложение = Макет.ПолучитьОбласть("Приложение");
	//	ОбластьПриложение.Параметры.Приложение = "Приложение к Акту оказанных услуг " + Акт;
	//	ТабДок.Вывести(ОбластьПриложение);
	//КонецЕсли;

	Если ЕстьШтрафы Тогда
		ОбластьШтраф = Макет.ПолучитьОбласть("Штраф");
		ТабДок.Вывести(ОбластьШтраф);

		ОбластьСтрШтраф1 = Макет.ПолучитьОбласть("СтрШтраф1");
		ОбластьСтрШтраф2 = Макет.ПолучитьОбласть("СтрШтраф2");

		Выб1 = РезШтрафы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выб1.Следующий() Цикл
			ОбластьСтрШтраф1.Параметры.ПунктДоговора = ПолучитьОписаниеПунктаДоговора(Выб1.ПунктДоговора);
			ТабДок.Вывести(ОбластьСтрШтраф1);

			НомерСтроки = 0;

			Выб2 = Выб1.Выбрать();
			Пока Выб2.Следующий() Цикл
				НомерСтроки = НомерСтроки + 1;

				Лист = "№ " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выб2.ЛистНомер) + " от " + Формат(
					Выб2.ЛистДата, "ДЛФ=Д") + " г.";
				Док = "№ " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выб2.РаспоряжениеНомер) + " от " + Формат(
					Выб2.РаспоряжениеДата, "ДЛФ=Д") + " г.";

				ОбластьСтрШтраф2.Параметры.НомерСтроки = НомерСтроки;
				ОбластьСтрШтраф2.Параметры.Транспорт = Выб2.Транспорт;
				ОбластьСтрШтраф2.Параметры.Водитель = Выб2.Водитель;
				ОбластьСтрШтраф2.Параметры.Лист = Лист;
				ОбластьСтрШтраф2.Параметры.Док = Док;
				ОбластьСтрШтраф2.Параметры.Сумма = Выб2.Сумма;

				ТабДок.Вывести(ОбластьСтрШтраф2);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	Если ЕстьПретензии Тогда
		ОбластьПретензии = Макет.ПолучитьОбласть("Претензии");
		ТабДок.Вывести(ОбластьПретензии);

		ОбластьСтрПретензии = Макет.ПолучитьОбласть("СтрПретензии");

		НомерСтроки = 0;

		Выб = РезПретензии.Выбрать();
		Пока Выб.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;

			Лист = "№ " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выб.ЛистНомер) + " от " + Формат(Выб.ЛистДата,
				"ДЛФ=Д") + " г.";
			Док = "№ " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выб.РаспоряжениеНомер) + " от " + Формат(
				Выб.РаспоряжениеДата, "ДЛФ=ДД") + " г.";

			ОбластьСтрПретензии.Параметры.Содержание = Выб.Содержание;
			ОбластьСтрПретензии.Параметры.НомерСтроки = НомерСтроки;
			ОбластьСтрПретензии.Параметры.Транспорт = Выб.Транспорт;
			ОбластьСтрПретензии.Параметры.Водитель = Выб.Водитель;
			ОбластьСтрПретензии.Параметры.Лист = Лист;
			ОбластьСтрПретензии.Параметры.Док = Док;
			ОбластьСтрПретензии.Параметры.Сумма = Выб.Сумма;

			ТабДок.Вывести(ОбластьСтрПретензии);
		КонецЦикла;
	КонецЕсли;

	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;

	Возврат ТабДок;
КонецФункции

Функция ПолучитьДанныеПакетаЗапроса(Док)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Док);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номер КАК Номер,
	|	т.Дата КАК Дата,
	|	т.Договор.Номер КАК ДоговорНомер,
	|	т.Договор.Дата КАК ДоговорДата,
	|	т.Договор.НаименованиеДляПечати КАК ДоговорНаименованиеДляПечати,
	|	т.ДатаНачала КАК ДатаНачала,
	|	т.ДатаОкончания КАК ДатаОкончания,
	|	т.Комментарий КАК Комментарий,
	|	т.Организация.НаименованиеСокращенное КАК Организация,
	|	т.Контрагент.НаименованиеПолное КАК Контрагент
	|ИЗ
	|	Документ._ТранспортныеУслуги КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рейсы.ТранспортноеСредство.Наименование КАК Транспорт,
	|	""Рейс"" КАК Ед,
	|	КОЛИЧЕСТВО(Рейсы.ТранспортноеСредство) КАК Количество,
	|	Рейсы.СтоимостьДоставки - Рейсы.СтавкаАгента КАК Цена,
	|	(Рейсы.СтоимостьДоставки - Рейсы.СтавкаАгента) * КОЛИЧЕСТВО(Рейсы.ТранспортноеСредство) КАК Сумма
	|ИЗ
	|	Документ._ТранспортныеУслуги.Рейсы КАК Рейсы
	|ГДЕ
	|	Рейсы.Метка
	|	И Рейсы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Рейсы.ТранспортноеСредство.Наименование,
	|	Рейсы.СтоимостьДоставки - Рейсы.СтавкаАгента,
	|	Рейсы.СтоимостьДоставки,
	|	Рейсы.СтавкаАгента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Доплата.ТранспортноеСредство.Наименование,
	|	""Доп. время"",
	|	КОЛИЧЕСТВО(Доплата.Распоряжение),
	|	Доплата.СтоимостьЧека,
	|	Доплата.СтоимостьЧека * КОЛИЧЕСТВО(Доплата.Распоряжение)
	|ИЗ
	|	Документ._ТранспортныеУслуги.ДоплатаЗаДополнительноеВремя КАК Доплата
	|ГДЕ
	|	Доплата.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Доплата.СтоимостьЧека,
	|	Доплата.ТранспортноеСредство.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Транспорт,
	|	Ед УБЫВ,
	|	Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрафы.ТранспортноеСредство.Наименование КАК Транспорт,
	|	Штрафы.ПунктДоговора КАК ПунктДоговора,
	|	КОЛИЧЕСТВО(Штрафы.ТранспортноеСредство) КАК Количество,
	|	Штрафы.СуммаШтрафа КАК Цена,
	|	Штрафы.СуммаШтрафа * КОЛИЧЕСТВО(Штрафы.ТранспортноеСредство) КАК Сумма
	|ИЗ
	|	Документ._ТранспортныеУслуги.ШтрафыЗаНарушенияДоговора КАК Штрафы
	|ГДЕ
	|	Штрафы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Штрафы.ТранспортноеСредство.Наименование,
	|	Штрафы.ПунктДоговора,
	|	Штрафы.СуммаШтрафа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Транспорт,
	|	ПунктДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Претензии.ТранспортноеСредство.Наименование КАК Транспорт,
	|	ВЫРАЗИТЬ(Претензии.СодержаниеПретензии КАК СТРОКА(500)) КАК Содержание,
	|	Претензии.СуммаПретензии КАК Сумма
	|ИЗ
	|	Документ._ТранспортныеУслуги.ШтрафыЗаПретензии КАК Претензии
	|ГДЕ
	|	Претензии.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Транспорт,
	|	Содержание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрафы.ПунктДоговора КАК ПунктДоговора,
	|	Штрафы.ТранспортноеСредство.Наименование КАК Транспорт,
	|	Штрафы.Водитель КАК Водитель,
	|	Штрафы.ЛогистическийЛист КАК Лист,
	|	Штрафы.ЛогистическийЛист.Номер КАК ЛистНомер,
	|	Штрафы.ЛогистическийЛист.Дата КАК ЛистДата,
	|	Штрафы.Распоряжение КАК Распоряжение,
	|	Штрафы.Распоряжение.Номер КАК РаспоряжениеНомер,
	|	Штрафы.Распоряжение.Дата КАК РаспоряжениеДата,
	|	Штрафы.СуммаШтрафа КАК Сумма
	|ИЗ
	|	Документ._ТранспортныеУслуги.ШтрафыЗаНарушенияДоговора КАК Штрафы
	|ГДЕ
	|	Штрафы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПунктДоговора,
	|	Транспорт
	|ИТОГИ ПО
	|	ПунктДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Претензии.ТранспортноеСредство.Наименование КАК Транспорт,
	|	Претензии.Водитель КАК Водитель,
	|	Претензии.ЛогистическийЛист КАК Лист,
	|	Претензии.ЛогистическийЛист.Номер КАК ЛистНомер,
	|	Претензии.ЛогистическийЛист.Дата КАК ЛистДата,
	|	Претензии.Распоряжение КАК Распоряжение,
	|	Претензии.Распоряжение.Номер КАК РаспоряжениеНомер,
	|	Претензии.Распоряжение.Дата КАК РаспоряжениеДата,
	|	Претензии.СуммаПретензии КАК Сумма,
	|	ВЫРАЗИТЬ(Претензии.СодержаниеПретензии КАК СТРОКА(500)) КАК Содержание
	|ИЗ
	|	Документ._ТранспортныеУслуги.ШтрафыЗаПретензии КАК Претензии
	|ГДЕ
	|	Претензии.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Транспорт,
	|	Содержание";

	Рез = Запрос.ВыполнитьПакет();

	Данные = Новый Структура;
	Данные.Вставить("Шапка", Рез[0]);
	Данные.Вставить("Рейсы", Рез[1]);
	Данные.Вставить("Штрафы", Рез[2]);
	Данные.Вставить("Претензии", Рез[3]);
	Данные.Вставить("ШтрафыДетали", Рез[4]);
	Данные.Вставить("ПретензииДетали", Рез[5]);

	Возврат Данные;
КонецФункции

Функция ПолучитьОписаниеПунктаДоговора(Пункт)
	Если Пункт = Перечисления._ПунктыДоговора.Пункт52 Тогда
		Возврат "" + Пункт + ": "
			+ "Исполнитель несет ответственность за повреждение и недостачу груза после принятия его к перевозке от Заказчика, в размере двукратной цены утраченного или поврежденного груза.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт53 Тогда
		Возврат "" + Пункт + ": "
			+ "Исполнитель несет ответственность за срыв выполнения логистического задания в размере однодневного тарифа данного автотранспорта.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт54 Тогда
		Возврат "" + Пункт + ": "
			+ "Исполнитель несет ответственность за несвоевременную доставку груза Грузополучателю заказчика в размере 25% от дневного тарифа данного автотранспорта.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт55 Тогда
		Возврат "" + Пункт + ": "
			+ "Исполнитель несет ответственность за несвоевременную сдачу Товарно-сопроводительных документов Заказчику в размере 500 руб./один документ.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт56 Тогда
		Возврат "" + Пункт + ": "
			+ "Исполнитель несет ответственность за утрату товарно-сопроводительных документов в размере однодневного тарифа данного автотранспорта.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт57 Тогда
		Возврат "" + Пункт + ": "
			+ "Исполнитель несет ответственность за невыход автотранспорта на маршрут, утвержденный в Логистическом листе с Заказчиком, в размере однодневного тарифа, соответствующей единицы автотранспорта.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт58 Тогда
		Возврат "" + Пункт + ": "
			+ "В случае, если указанные в настоящем пункте документы, а именно: УПД, Товарная накладная формы Торг-12, Товарно-Транспортная накладная не будут подписаны со стороны Грузополучателя, либо подписанные Грузополучателем документы не будут переданы Исполнителе";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт59 Тогда
		Возврат "" + Пункт + ": "
			+ "В случае невыполнения логистического задания Исполнитель возмещает Заказчику все понесенные им убытки в полном размере.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт71 Тогда
		Возврат "" + Пункт + ": "
			+ "За непредоставление груза к перевозке (незагрузка автомобиля в течение двух часов) по согласованному маршрутному листу Заказчик уплачивает Перевозчику штраф в размере 20% от стоимости услуг Перевозчика за один рабочий день.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт72 Тогда
		Возврат "" + Пункт + ": "
			+ "За отмену доставки груза грузополучателю после подачи транспортного средства на склад Заказчика под загрузку, Заказчик оплачивает штраф в размере 20% от стоимости услуг Перевозчика за один рабочий день.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт73 Тогда
		Возврат "" + Пункт + ": "
			+ "За нарушение сроков оплаты оказанных услуг Заказчик оплачивает Перевозчику пени в размере 0,2% от просроченной суммы за каждый день просрочки. ";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт74 Тогда
		Возврат "" + Пункт + ": "
			+ "За неподачу (опоздание более двух часов) транспортного средства под загрузку, в соответствии с согласованным маршрутным листом, Перевозчик оплачивает Заказчику штраф в размере стоимости услуг Перевозчика за один рабочий день.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт75 Тогда
		Возврат "" + Пункт + ": "
			+ "За повреждение и недостачу груза после принятия его к перевозке от Заказчика Перевозчик уплачивает Заказчику штраф в размере двукратной цены без НДС утраченного или поврежденного груза.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт76 Тогда
		Возврат "" + Пункт + ": "
			+ "За несвоевременную доставку груза Грузополучателю Перевозчик оплачивает Заказчику штраф в размере 25% от стоимости услуг Перевозчика за один рабочий день.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт77 Тогда
		Возврат "" + Пункт + ": "
			+ "За срыв выполнения маршрутного задания Перевозчик оплачивает Заказчику штраф в размере стоимости услуг Перевозчика за один рабочий день и возвращает груз Заказчику не позднее следующего дня за днем перевозки.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт78 Тогда
		Возврат "" + Пункт + ": "
			+ "За несвоевременную сдачу товаросопроводительных документов Заказчику Перевозчик оплачивает Заказчику штраф в размере 500 руб. за один документ.";

	ИначеЕсли Пункт = Перечисления._ПунктыДоговора.Пункт79 Тогда
		Возврат "" + Пункт + ": "
			+ "За утрату товаросопроводительных документов Заказчика Перевозчик оплачивает Заказчику штраф в размере стоимости услуг Перевозчика за один рабочий день.";
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли
